---
kind: other
id: Properties.T:Autodesk.Revit.DB.TriangulationInterfaceForTriangulatedSolidOrShell
source: html/a5ee6324-718e-3e18-8b85-73276a2c91e1.htm
---
# TriangulationInterfaceForTriangulatedSolidOrShell Properties

Specifies whether the .NET object represents a valid Revit entity.